# ProjectElevation Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
Level..::..ProjectElevation Property
Level Class See Also
---
Retrieves the elevation relative to project origin, no matter what values of the Elevation Base parameter is set.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public double ProjectElevation { get; }
```

Visual Basic
---
```text
Public ReadOnly Property ProjectElevation As Double
	Get
```

Visual C++
---
```text
public:
property double ProjectElevation {
	double get ();
}
```

# Remarks
This read only property returns the elevation relative to project origin.
# See Also
Level Class
Autodesk.Revit.DB Namespace